app/helpers/WatriHelper.php

    public static function update_gtfs(string $id): void
    {
        $name = GtfsTable::find($id)->name;
        GtfsTable::where('name', $name)
            ->update(['name' => $name]);
---
update `gtfs` set `name` = 'test-GTFS001', `gtfs`.`updated_at` = '2022-04-01 19:35:46' where `name` = 'test-GTFS001'