app/Http/Controllers/AgencyController.php

    public function index(Request $request)
    {

        if (!WatriCheck::session($request, 'gtfs_id')) {
            return redirect()->to('/gtfs');
        }
        $gtfs = Gtfs::find(session('gtfs_id'));

        if ($request->t === csrf_token() && $gtfs->password === $request->_ && $request->a === 'true') {

            return response()->json($gtfs->agencies()->get());
        }

        $agencies = $gtfs->agencies()->get();
---
select * from `agencies` where `agencies`.`gtfs_id` = 70 and `agencies`.`gtfs_id` is not null

    public function store(Request $request)
    {

        $validatedData = $request->validate([
            'agency_name' => 'required',
            'agency_url' => 'regex:/^(https?:\/\/)?([\da-z\.-]+)\.([a-z\.]{2,6})([\/\w \.-]*)*\/?$/',
            'agency_timezone' => 'required',
            'gtfs' => 'required'
        ]);

        $agency = new Agency();


        $agency->agency_id = $request->agency_id;

        if (!$request->agency_id) {
            $agency->agency_id = WatriHelper::initial_id($request->agency_name);
        }
        $agency->agency_name = $request->agency_name;
        $agency->agency_url = $request->agency_url;
        $agency->agency_timezone = $request->agency_timezone;
        $agency->agency_lang = $request->agency_lang;
        $agency->agency_phone = $request->agency_phone;
        $agency->agency_fare_url = $request->agency_fare_url;
        $agency->agency_email = $request->agency_email;
        $agency->gtfs_id = $request->gtfs;

        $agency->save();
---
insert into `agencies` (`agency_id`, `agency_name`, `agency_url`, `agency_timezone`, `agency_lang`, `agency_phone`, `agency_fare_url`, `agency_email`, `gtfs_id`, `updated_at`, `created_at`) values ('qwertyu', 'qwetyu', 'wer.ertyu.ertyu', '1234567', '', '', '', '', '70', '2022-04-01 19:24:23', '2022-04-01 19:24:23')

    public function edit($id, Request $request)
    {

        $column_name = $request->input('column_name');
        $value = $request->input('value');

        $validate_column_name = $column_name;

        if ($validate_column_name === 'agency_name') {
            $request->validate([
                'value' => 'required'
            ]);
        }
        if ($validate_column_name === 'agency_url') {
            $request->validate([
                'value' => 'regex:/^(https?:\/\/)?([\da-z\.-]+)\.([a-z\.]{2,6})([\/\w \.-]*)*\/?$/'
            ]);
        }
        if ($validate_column_name === 'agency_timezone') {

            $request->validate([
                'value' => 'required'
            ]);
        }


        Agency::where('id', $id)
            ->update([$column_name => $value]);
---
update `agencies` set `agency_url` = 'sdfs.wrew.wewr', `agencies`.`updated_at` = '2022-04-01 20:02:47' where `id` = '217'

    public function destroy($id)
    {
        Agency::destroy($id);
---
delete from `agencies` where `id` = 216

    final public function get_agencies(Request $request): ?JsonResponse
    {
        $gtfs = Gtfs::find($request->g);
        if ($request->t === csrf_token() && $gtfs->password === $request->_) {
            return response()->json($gtfs->agencies()->get());
---
select * from `agencies` where `id` in ('216')