app/Http/Controllers/GtfsController.php

insert into `gtfs` (`name`, `password`, `user_id`, `updated_at`, `created_at`) values ('test-GTFS001', 'y$Om0a/xJbZSCvN9H/UDZ2iOs/S3Zw0svFeIhthVm8svz9WydZDGZvO', 1, '2022-04-01 18:48:38', '2022-04-01 18:48:38')
---
    public function store(Request $request)
    {
        $this->validate(request(), [
            'name' => 'required|unique:gtfs|max:150',
            'password' => 'required|min:7|confirmed'
        ]);

        $gtfs = new GtfsTable();
        $gtfs->name = $request->name;
        $gtfs->password = bcrypt(request('password'));
        $gtfs->user_id = Auth::id();

        $gtfs->save();

select * from `gtfs` where `name` = 'ABIDJAN_UPDATE' limit 1
---
    public function setting(Request $request)
    {
        $gtfs = $request->gtfs;
        $gtfs = GtfsTable::where('name', $gtfs)->first();