app/Http/Controllers/ShapeController.php

    public function index(Request $request)
    {
//        dd($this->distance(12.606099,-8.010214,12.6531188,-7.981954,"K"));
        if (!WatriCheck::session($request, 'gtfs_id')) {
            return redirect()->to('/gtfs');
        }
        $gtfs = Gtfs::find(session('gtfs_id'));

        $t = csrf_token();
        $gtfs_id = session('gtfs_id');
        if (isset($request->search)) {
            $shapes = $gtfs->shapes()->where('shape_id', $request->search)->paginate(100);
            $shapes->withPath("/shape?t=$t&g=$gtfs_id&_=$request->_&search=$request->search");

        } else {

            $shapes = $gtfs->shapes()->paginate(100);
            $shapes->withPath("/shape?t=$t&g=$gtfs_id&_=$request->_");

        }
        $data = DB::table('shapes')
            ->where('gtfs_id', $gtfs_id)
            ->select('shape_id')
            ->groupBy('shape_id')
            ->paginate(5);
---
select `shape_id` from `shapes` where `gtfs_id` = 9 group by `shape_id` limit 5 offset 0
select count(*) as aggregate from `shapes` where `gtfs_id` = 9 group by `shape_id`