app/Http/Controllers/StopController.php

    public function getDataMap(Request $request)
    {
        if (!WatriCheck::session($request, 'gtfs_id')) {
            return redirect()->to('/gtfs');
        }

        $gtfs = Gtfs::find(session('gtfs_id'));

        return response()->json($gtfs->stops()->get());
---
select * from `stops` where `stops`.`gtfs_id` = 9 and `stops`.`gtfs_id` is not null