app/Http/Controllers/UserController.php

select * from `users`
---
    public function index()
    {
        if((int)Auth::id()!==1) {
            dd();
        }
        $users = User::all();